{
  "format": "graph-model",
  "generatedBy": "2.6.2",
  "convertedBy": "TensorFlow.js Converter v3.18.0",
  "signature": {
    "inputs": {
      "user_id:0": {
        "name": "user_id:0",
        "dtype": "DT_STRING",
        "tensorShape": { "dim": [{ "size": "-1" }] }
      },
      "video_id:0": {
        "name": "video_id:0",
        "dtype": "DT_STRING",
        "tensorShape": { "dim": [{ "size": "-1" }] }
      }
    },
    "outputs": {
      "output_1": {
        "name": "Identity:0",
        "dtype": "DT_FLOAT",
        "tensorShape": { "dim": [{ "size": "-1" }, { "size": "1" }] }
      }
    }
  },
  "modelTopology": {
    "node": [
      {
        "name": "unknown_1",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "102" }, { "size": "32" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "unknown_0",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": {} } },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "StatefulPartitionedCall/video_ranking_model/ranking_model/sequential_2/embedding_2/embedding_lookup/axis",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": {} } },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "unknown_4",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "1001" }, { "size": "32" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "unknown_3",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": {} } },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "StatefulPartitionedCall/video_ranking_model/ranking_model/sequential_3/embedding_3/embedding_lookup/axis",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": {} } },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "StatefulPartitionedCall/video_ranking_model/ranking_model/concat/axis",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/video_ranking_model/ranking_model/sequential_4/dense/MatMul/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }, { "size": "128" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/video_ranking_model/ranking_model/sequential_4/dense/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/video_ranking_model/ranking_model/sequential_4/dense_1/MatMul/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }, { "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/video_ranking_model/ranking_model/sequential_4/dense_1/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/video_ranking_model/ranking_model/sequential_4/dense_2/MatMul/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }, { "size": "1" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/video_ranking_model/ranking_model/sequential_4/dense_2/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "unknown",
        "op": "Placeholder",
        "attr": { "shape": { "shape": {} }, "dtype": { "type": "DT_RESOURCE" } }
      },
      {
        "name": "unknown_2",
        "op": "Placeholder",
        "attr": { "shape": { "shape": {} }, "dtype": { "type": "DT_RESOURCE" } }
      },
      {
        "name": "user_id",
        "op": "Placeholder",
        "attr": {
          "shape": { "shape": { "dim": [{ "size": "-1" }] } },
          "dtype": { "type": "DT_STRING" }
        }
      },
      {
        "name": "video_id",
        "op": "Placeholder",
        "attr": {
          "shape": { "shape": { "dim": [{ "size": "-1" }] } },
          "dtype": { "type": "DT_STRING" }
        }
      },
      {
        "name": "StatefulPartitionedCall/video_ranking_model/ranking_model/sequential_2/string_lookup_2/None_Lookup/LookupTableFindV2",
        "op": "LookupTableFindV2",
        "input": ["unknown", "user_id", "unknown_0"],
        "attr": {
          "Tout": { "type": "DT_INT64" },
          "Tin": { "type": "DT_STRING" }
        }
      },
      {
        "name": "StatefulPartitionedCall/video_ranking_model/ranking_model/sequential_3/string_lookup_3/None_Lookup/LookupTableFindV2",
        "op": "LookupTableFindV2",
        "input": ["unknown_2", "video_id", "unknown_3"],
        "attr": {
          "Tout": { "type": "DT_INT64" },
          "Tin": { "type": "DT_STRING" }
        }
      },
      {
        "name": "StatefulPartitionedCall/video_ranking_model/ranking_model/sequential_2/embedding_2/embedding_lookup",
        "op": "GatherV2",
        "input": [
          "unknown_1",
          "StatefulPartitionedCall/video_ranking_model/ranking_model/sequential_2/string_lookup_2/None_Lookup/LookupTableFindV2",
          "StatefulPartitionedCall/video_ranking_model/ranking_model/sequential_2/embedding_2/embedding_lookup/axis"
        ],
        "attr": {
          "Taxis": { "type": "DT_INT64" },
          "batch_dims": { "i": "0" },
          "Tindices": { "type": "DT_INT64" },
          "Tparams": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/video_ranking_model/ranking_model/sequential_3/embedding_3/embedding_lookup",
        "op": "GatherV2",
        "input": [
          "unknown_4",
          "StatefulPartitionedCall/video_ranking_model/ranking_model/sequential_3/string_lookup_3/None_Lookup/LookupTableFindV2",
          "StatefulPartitionedCall/video_ranking_model/ranking_model/sequential_3/embedding_3/embedding_lookup/axis"
        ],
        "attr": {
          "Taxis": { "type": "DT_INT64" },
          "batch_dims": { "i": "0" },
          "Tindices": { "type": "DT_INT64" },
          "Tparams": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/video_ranking_model/ranking_model/concat",
        "op": "ConcatV2",
        "input": [
          "StatefulPartitionedCall/video_ranking_model/ranking_model/sequential_2/embedding_2/embedding_lookup",
          "StatefulPartitionedCall/video_ranking_model/ranking_model/sequential_3/embedding_3/embedding_lookup",
          "StatefulPartitionedCall/video_ranking_model/ranking_model/concat/axis"
        ],
        "attr": {
          "Tidx": { "type": "DT_INT32" },
          "T": { "type": "DT_FLOAT" },
          "N": { "i": "2" }
        }
      },
      {
        "name": "StatefulPartitionedCall/video_ranking_model/ranking_model/sequential_4/dense/Relu",
        "op": "_FusedMatMul",
        "input": [
          "StatefulPartitionedCall/video_ranking_model/ranking_model/concat",
          "StatefulPartitionedCall/video_ranking_model/ranking_model/sequential_4/dense/MatMul/ReadVariableOp",
          "StatefulPartitionedCall/video_ranking_model/ranking_model/sequential_4/dense/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "transpose_b": { "b": false },
          "T": { "type": "DT_FLOAT" },
          "num_args": { "i": "1" },
          "epsilon": { "f": 0.0 },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdQ=="] } },
          "transpose_a": { "b": false }
        }
      },
      {
        "name": "StatefulPartitionedCall/video_ranking_model/ranking_model/sequential_4/dense_1/Relu",
        "op": "_FusedMatMul",
        "input": [
          "StatefulPartitionedCall/video_ranking_model/ranking_model/sequential_4/dense/Relu",
          "StatefulPartitionedCall/video_ranking_model/ranking_model/sequential_4/dense_1/MatMul/ReadVariableOp",
          "StatefulPartitionedCall/video_ranking_model/ranking_model/sequential_4/dense_1/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "transpose_b": { "b": false },
          "T": { "type": "DT_FLOAT" },
          "num_args": { "i": "1" },
          "epsilon": { "f": 0.0 },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdQ=="] } },
          "transpose_a": { "b": false }
        }
      },
      {
        "name": "StatefulPartitionedCall/video_ranking_model/ranking_model/sequential_4/dense_2/BiasAdd",
        "op": "_FusedMatMul",
        "input": [
          "StatefulPartitionedCall/video_ranking_model/ranking_model/sequential_4/dense_1/Relu",
          "StatefulPartitionedCall/video_ranking_model/ranking_model/sequential_4/dense_2/MatMul/ReadVariableOp",
          "StatefulPartitionedCall/video_ranking_model/ranking_model/sequential_4/dense_2/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "transpose_b": { "b": false },
          "T": { "type": "DT_FLOAT" },
          "num_args": { "i": "1" },
          "epsilon": { "f": 0.0 },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA=="] } },
          "transpose_a": { "b": false }
        }
      },
      {
        "name": "Identity",
        "op": "Identity",
        "input": [
          "StatefulPartitionedCall/video_ranking_model/ranking_model/sequential_4/dense_2/BiasAdd"
        ],
        "attr": { "T": { "type": "DT_FLOAT" } }
      }
    ],
    "library": {},
    "versions": { "producer": 808 }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        { "name": "unknown_1", "shape": [102, 32], "dtype": "float32" },
        { "name": "unknown_0", "shape": [], "dtype": "int32" },
        {
          "name": "StatefulPartitionedCall/video_ranking_model/ranking_model/sequential_2/embedding_2/embedding_lookup/axis",
          "shape": [],
          "dtype": "int32"
        },
        { "name": "unknown_4", "shape": [1001, 32], "dtype": "float32" },
        { "name": "unknown_3", "shape": [], "dtype": "int32" },
        {
          "name": "StatefulPartitionedCall/video_ranking_model/ranking_model/sequential_3/embedding_3/embedding_lookup/axis",
          "shape": [],
          "dtype": "int32"
        },
        {
          "name": "StatefulPartitionedCall/video_ranking_model/ranking_model/concat/axis",
          "shape": [],
          "dtype": "int32"
        },
        {
          "name": "StatefulPartitionedCall/video_ranking_model/ranking_model/sequential_4/dense/MatMul/ReadVariableOp",
          "shape": [64, 128],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/video_ranking_model/ranking_model/sequential_4/dense/BiasAdd/ReadVariableOp",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/video_ranking_model/ranking_model/sequential_4/dense_1/MatMul/ReadVariableOp",
          "shape": [128, 64],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/video_ranking_model/ranking_model/sequential_4/dense_1/BiasAdd/ReadVariableOp",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/video_ranking_model/ranking_model/sequential_4/dense_2/MatMul/ReadVariableOp",
          "shape": [64, 1],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/video_ranking_model/ranking_model/sequential_4/dense_2/BiasAdd/ReadVariableOp",
          "shape": [1],
          "dtype": "float32"
        }
      ]
    }
  ]
}
